---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures
source: html/6768214f-3136-86f3-48fa-76b4199e9bdb.htm
---
# BuiltInFailures.PartMakerMethodForMergePartFailures Properties

A merged part geometry has dis-connected components.